# Data Cleaning and Preprocessing

In [6]:
import pandas as pd
df = pd.read_csv('dirty_data.csv')
df

,Customer ID,Name,Age,Date of Birth,Email,Income Status,Mobile No,Country,Mobile Active,Email Active,City,Action,Time Spent,Transaction_Amount,Product Code
0,OW904880,Soo,16.0,1988-03-13,cap2033@live.com,>=50k,9.176670e+11,India,1.0,1.0,Jori Kalān,['order cancel' 'Login' 'Home Page Visit' 'Oth...,02:24:54,NaN,"['RWBK1974', 'UGEZ5968', 'UZXQ2388', 'YULT0904..."
1,JI602226,Sirena,16.0,1978-03-24,criteria2052@duck.com,>=50k,5.098779e+12,Haiti,1.0,1.0,Capotille,['Other' 'Login' 'Add to cart'],10:38:43,NaN,['GTYK2067']
2,PY383337,Jae,23.0,2007-07-30,cosmetics1871@live.com,unemployed,6.556867e+09,Mqadagascar,1.0,1.0,Ifanadiana,['Home Page Visit' 'Shared product'],06:50:26,80.410000,"['YGCY4374', 'DGCN9800', 'KTHY6205']"
3,DB936083,Alysa,68.0,2004-07-09,johnny2002@outlook.com,unemployed,8.242074e+09,Inia,NaN,1.0,Dandkhora,['Signup' 'Other' 'Purchase' 'Add to cart'],22:46:33,9761.340000,"['NRTV8938', 'VJLF6076', 'AQSJ3755', 'BCNE8192..."
4,FJ701419,Winfred,22.0,2011-04-17,teaching2036@outlook.com,<50k,3.485019e+11,Spain,1.0,1.0,San Baudilio de Llobregat,['Signup'],NaN,1.410000,"['SIQE9895', 'OLDU9228', 'XXOD0898', 'HIBM3335']"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
199995,PC298280,Marcus,40.0,1990-03-02,custody1893@example.org,unemployed,3.586034e+12,Finland,1.0,0.0,i,['Login' 'Add to cart' 'Home Page Visit' 'orde...,10:40:35,1835.150000,NaN
199996,KS897422,Magaly,50.0,1998-11-25,commit1883@duck.com,<50k,1.978505e+10,United States,1.0,1.0,Alamosa,['Login' 'Purchase' 'Other'],04:47:24,24597.584811,"['DMPP4320', 'DXUA6938', 'DZYP6122', 'PLFV6139..."
199997,SK780526,Jessenia,31.0,1967-10-06,sunset1927@protonmail.com,<50k,3.816082e+12,Serbia,1.0,1.0,Bela Crkva,['order cancel' 'Login'],00:26:53,5923.930000,"['LQXY6679', 'GXMX8435', 'MTNE3279', 'KSMZ0237..."
199998,MY164617,Chantell,59.0,1966-12-17,thoroughly1802@example.org,>=50k,9.177351e+11,India,1.0,0.0,Kolkata,['Home Page Visit'],20:47:47,NaN,"['CLIE7560', 'VNRL5758', 'ULNZ4324', 'LNOB5286..."
199999,BJ305112,Cinderella,32.0,1993-04-26,adds2064@example.org,>=50k,9.189333e+11,India,0.0,0.0,Delhi,['Login' 'Shared product' 'Purchase' 'Save for...,19:04:46,95.820000,"['UJKY0235', 'SXDT8422', 'TNCW4530', 'OWFL7958']"

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 15 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Customer ID         197800 non-null  object
 1   Name                188400 non-null  object
 2   Age                 192801 non-null  float64
 3   Date of Birth       195800 non-null  object
 4   Email               196800 non-null  object
 5   Income Status       189400 non-null  object
 6   Mobile No           193200 non-null  float64
 7   Country             197600 non-null  object
 8   Mobile Active       192000 non-null  float64
 9   Email Active        197600 non-null  float64
 10  City                197200 non-null  object
 11  Action              194600 non-null  object
 12  Time Spent          192000 non-null  object
 13  Transaction_Amount  141272 non-null  float64
 14  Product Code        190200 non-null  object
dtypes: float64(5), object(10)
memory usage: 22.9+ MB

In [15]:
useful_df = df[['Customer ID','Email Active','Mobile Active','City','Time Spent', 'Transaction_Amount', 'Product Code']]

In [16]:
useful_df

,Customer ID,Email Active,Mobile Active,City,Time Spent,Transaction_Amount,Product Code
0,OW904880,1.0,1.0,Jori Kalān,02:24:54,NaN,"['RWBK1974', 'UGEZ5968', 'UZXQ2388', 'YULT0904..."
1,JI602226,1.0,1.0,Capotille,10:38:43,NaN,['GTYK2067']
2,PY383337,1.0,1.0,Ifanadiana,06:50:26,80.410000,"['YGCY4374', 'DGCN9800', 'KTHY6205']"
3,DB936083,1.0,NaN,Dandkhora,22:46:33,9761.340000,"['NRTV8938', 'VJLF6076', 'AQSJ3755', 'BCNE8192..."
4,FJ701419,1.0,1.0,San Baudilio de Llobregat,NaN,1.410000,"['SIQE9895', 'OLDU9228', 'XXOD0898', 'HIBM3335']"
...,...,...,...,...,...,...,...
199995,PC298280,0.0,1.0,i,10:40:35,1835.150000,NaN
199996,KS897422,1.0,1.0,Alamosa,04:47:24,24597.584811,"['DMPP4320', 'DXUA6938', 'DZYP6122', 'PLFV6139..."
199997,SK780526,1.0,1.0,Bela Crkva,00:26:53,5923.930000,"['LQXY6679', 'GXMX8435', 'MTNE3279', 'KSMZ0237..."
199998,MY164617,0.0,1.0,Kolkata,20:47:47,NaN,"['CLIE7560', 'VNRL5758', 'ULNZ4324', 'LNOB5286..."
199999,BJ305112,0.0,0.0,Delhi,19:04:46,95.820000,"['UJKY0235', 'SXDT8422', 'TNCW4530', 'OWFL7958']"